###  1. gapminder.tsv파일을 읽고 다음 작업을 진행하시오 
#### (read_csv를 사용하되, sep=\t로 설정하여 읽을 것)

In [12]:
import pandas as pd

In [13]:
df=pd.read_csv('gapminder.tsv',sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

#### -자료 크기, 차원, 컬럼, 타입 등 읽어들인 자료의 구조를 확인하시오

In [16]:
#차원 확인
df.shape

(1704, 6)

In [21]:
#타입확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

#### -국가명, 대륙명, 연도 열을 추출하시오

In [22]:
df['country']

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [24]:
df['continent']

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object

In [25]:
df['year']

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

#### -lifeExp(기대수명),pop(인구),gdp(소득)의 최대/최소/평균/표준편차

In [26]:
df[['lifeExp','pop','gdpPercap']].describe()

           lifeExp           pop      gdpPercap
count  1704.000000  1.704000e+03    1704.000000
mean     59.474439  2.960121e+07    7215.327081
std      12.917107  1.061579e+08    9857.454543
min      23.599000  6.001100e+04     241.165876
25%      48.198000  2.793664e+06    1202.060309
50%      60.712500  7.023596e+06    3531.846988
75%      70.845500  1.958522e+07    9325.462346
max      82.603000  1.318683e+09  113523.132900

In [31]:
print(df['lifeExp'].max())
print(df['lifeExp'].min())
print(df['lifeExp'].mean())
print(df['lifeExp'].std())

82.603
23.599
59.474439366197174
12.917107415241192

### 2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
#### (1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
#### (2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.
#### -> NaN, 컬럼/행 index지정 등 연습

In [34]:
df={
    "국어":[70,72,84,90,95],
    "수학":[50,65,70,84.5,85],
    "영어":[80.5,'',69,100,95],
    "출석":['출석','지각','출석','출석','지각'],
    "수행평가":["pass", "fail", "pass", "pass",'pass']
}
df

{'국어': [70, 72, 84, 90, 95],
 '수학': [50, 65, 70, 84.5, 85],
 '영어': [80.5, '', 69, 100, 95],
 '출석': ['출석', '지각', '출석', '출석', '지각'],
 '수행평가': ['pass', 'fail', 'pass', 'pass', 'pass']}

In [36]:
score= pd.DataFrame(df)
score

   국어    수학    영어  출석  수행평가
0  70  50.0  80.5  출석  pass
1  72  65.0        지각  fail
2  84  70.0    69  출석  pass
3  90  84.5   100  출석  pass
4  95  85.0    95  지각  pass

In [39]:
score.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
idx=["학생1", "학생2", "학생3", "학생4",'학생5']
score=pd.DataFrame(df, index=idx)

In [44]:
score.index.name='학생번호'
score.columns.name='과목'

In [45]:
score

과목    국어    수학    영어  출석  수행평가
학생번호
학생1   70  50.0  80.5  출석  pass
학생2   72  65.0        지각  fail
학생3   84  70.0    69  출석  pass
학생4   90  84.5   100  출석  pass
학생5   95  85.0    95  지각  pass

In [46]:
#학생 1~2
score[:3]

과목    국어    수학    영어  출석  수행평가
학생번호
학생1   70  50.0  80.5  출석  pass
학생2   72  65.0        지각  fail
학생3   84  70.0    69  출석  pass

In [49]:
#수학, 출석
score[['수학','출석']]

과목      수학  출석
학생번호
학생1   50.0  출석
학생2   65.0  지각
학생3   70.0  출석
학생4   84.5  출석
학생5   85.0  지각

### 3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [51]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

#### (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

In [52]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

#### (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

In [53]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

#### (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

In [55]:
df
df['평균']= (df['국어']+df['수학']+df['영어'])/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

#### (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

In [59]:
df['영어']['방자']=80
df['평균']= (df['국어']+df['수학']+df['영어'])/3
df

<ipython-input-59-8b70a7b149fd>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자']=80

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

#### (5) 춘향의 점수를 데이터프레임으로 나타낸다.

In [60]:
df[:1]

    국어  영어  수학         평균
춘향  80  90  90  86.666667

#### (6) 향단의 점수를 시리즈로 나타낸다.

In [65]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

### 4. 제공된 파일중 scientists.csv 파일을 읽고, 다음 작업을 진행하시오

In [66]:
df = pd.read_csv('scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

#### -나이 최대값

In [67]:
df['Age'].max()

90

#### -나이 평균

In [68]:
df['Age'].mean()

59.125

#### -나이 평균보다 큰 나이 값을 모두 출력

In [69]:
df[df['Age']>df['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

#### -나이에 2를 곱한 값으로 'ages2' 열 추가

In [70]:
df['ages2']=df['Age']*2
df

,Name,Born,Died,Age,Occupation,ages2
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,74
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,122
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,180
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,132
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,112
5,John Snow,1813-03-15,1858-06-16,45,Physician,90
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,82
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,154